
'''
运算符
参考资料：https://www.runoob.com/python/python-operators.html

算术运算符
比较（关系）运算符
赋值运算符
逻辑运算符
位运算符
成员运算符
身份运算符
运算符优先级
'''


'''
算术运算符
+ 
-
* 
/ 
%    取模 - 返回除法的余数
**   幂 - 返回x的y次幂。10**3 表示 10的3次方 = 1000
//   取整除 - 返回商的整数部分(向下取整) 9//2 = 4   -9//2 = -5
'''
# 注意：Python2.x 里，整数除整数，只能得出整数。如果要得到小数部分，把其中一个数改成浮点数即可。
print(1/2)
print(1/2.0)


'''
比较（关系）运算符

定义变量  a=10  b=20
==      a==b返回 False
!=      a!=b返回 True
<>      不等于，python3已废弃
>
< 
>=
<=
'''


'''
赋值运算符

定义变量  a=10  b=20
=
+=
-=
*=
/=
%=
**=
//=
'''


'''
位运算符

'''


# 逻辑运算符


# 成员运算符


# 身份运算符


# 运算符优先级